{"keras_version": "2.2.4", "backend": "tensorflow", "config": {"name": "sequential_10", "layers": [{"config": {"trainable": true, "bias_constraint": null, "kernel_regularizer": null, "data_format": "channels_last", "name": "conv2d_62", "kernel_constraint": null, "activity_regularizer": null, "strides": [1, 1], "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "padding": "same", "kernel_size": [3, 3], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 16, "dilation_rate": [1, 1], "use_bias": false, "activation": "linear"}, "class_name": "Conv2D"}, {"config": {"beta_regularizer": null, "momentum": 0.99, "gamma_regularizer": null, "trainable": true, "epsilon": 0.001, "name": "batch_normalization_68", "axis": -1, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "scale": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "center": true, "beta_constraint": null}, "class_name": "BatchNormalization"}, {"config": {"name": "leaky_re_lu_33", "alpha": 0.10000000149011612, "trainable": true}, "class_name": "LeakyReLU"}, {"config": {"pool_size": [2, 2], "trainable": true, "data_format": "channels_last", "name": "max_pooling2d_27", "padding": "same", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "bias_constraint": null, "kernel_regularizer": null, "data_format": "channels_last", "name": "conv2d_63", "kernel_constraint": null, "activity_regularizer": null, "strides": [1, 1], "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "padding": "same", "kernel_size": [3, 3], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 8, "dilation_rate": [1, 1], "use_bias": false, "activation": "linear"}, "class_name": "Conv2D"}, {"config": {"beta_regularizer": null, "momentum": 0.99, "gamma_regularizer": null, "trainable": true, "epsilon": 0.001, "name": "batch_normalization_69", "axis": -1, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "scale": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "center": true, "beta_constraint": null}, "class_name": "BatchNormalization"}, {"config": {"name": "leaky_re_lu_34", "alpha": 0.10000000149011612, "trainable": true}, "class_name": "LeakyReLU"}, {"config": {"pool_size": [2, 2], "trainable": true, "data_format": "channels_last", "name": "max_pooling2d_28", "padding": "same", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "bias_constraint": null, "kernel_regularizer": null, "data_format": "channels_last", "name": "conv2d_64", "kernel_constraint": null, "activity_regularizer": null, "strides": [1, 1], "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "padding": "same", "kernel_size": [3, 3], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 8, "dilation_rate": [1, 1], "use_bias": false, "activation": "linear"}, "class_name": "Conv2D"}, {"config": {"beta_regularizer": null, "momentum": 0.99, "gamma_regularizer": null, "trainable": true, "epsilon": 0.001, "name": "batch_normalization_70", "axis": -1, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "scale": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "center": true, "beta_constraint": null}, "class_name": "BatchNormalization"}, {"config": {"name": "leaky_re_lu_35", "alpha": 0.10000000149011612, "trainable": true}, "class_name": "LeakyReLU"}, {"config": {"pool_size": [2, 2], "trainable": true, "data_format": "channels_last", "name": "max_pooling2d_29", "padding": "same", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "bias_constraint": null, "kernel_regularizer": null, "data_format": "channels_last", "name": "conv2d_65", "kernel_constraint": null, "activity_regularizer": null, "strides": [1, 1], "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "padding": "same", "kernel_size": [3, 3], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 8, "dilation_rate": [1, 1], "use_bias": false, "activation": "linear"}, "class_name": "Conv2D"}, {"config": {"beta_regularizer": null, "momentum": 0.99, "gamma_regularizer": null, "trainable": true, "epsilon": 0.001, "name": "batch_normalization_71", "axis": -1, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "scale": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "center": true, "beta_constraint": null}, "class_name": "BatchNormalization"}, {"config": {"name": "leaky_re_lu_36", "alpha": 0.10000000149011612, "trainable": true}, "class_name": "LeakyReLU"}, {"config": {"pool_size": [2, 2], "trainable": true, "data_format": "channels_last", "name": "max_pooling2d_30", "padding": "same", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"data_format": "channels_last", "name": "flatten_10", "trainable": true}, "class_name": "Flatten"}, {"config": {"use_bias": true, "bias_constraint": null, "kernel_regularizer": null, "name": "input_hidden", "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "normal", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 32, "bias_regularizer": null, "trainable": true, "activation": "linear"}, "class_name": "Dense"}, {"config": {"name": "activation_54", "trainable": true, "activation": "custom_activation"}, "class_name": "Activation"}, {"config": {"use_bias": true, "bias_constraint": null, "kernel_regularizer": null, "name": "hidden_output", "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 2, "bias_regularizer": null, "trainable": true, "activation": "linear"}, "class_name": "Dense"}, {"config": {"name": "activation_55", "trainable": true, "activation": "linear"}, "class_name": "Activation"}]}, "class_name": "Sequential"}